Revit 2026 API

# VertexPosition Constructor

---

Constructs the vertex from a point.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public VertexPosition(
	XYZ position
)
```
```vb
Public Sub New (
	position As XYZ
)
```
```cpp
public:
VertexPosition(
	XYZ^ position
)
```
```fsharp
new :
        position : XYZ -> VertexPosition
```

#### Parameters

position XYZ
     The vertex's position.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

VertexPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace